[
  {
    "title": "Class Bank Fund Manager",
    "description": "Developed an application for managing class funds during high school. It helped keep track of money and expenses easily. Used C#, UWP, and XAML.",
    "tech_stack": ["C#", "UWP", "XAML"]
  },
  {
    "title": "Curious Village",
    "description": "Created an educational game to teach children about internet safety. It won first place in class. The game helps kids learn not to share personal information online. Developed using TypeScript, OOP, and Canvas.",
    "tech_stack": ["TypeScript", "OOP", "Canvas"]
  },
  {
    "title": "Ligplatsen Zeeland",
    "description": "Built a web application where people can browse and rent parking spaces for their boats. Used technologies like Laravel, JavaScript, PHP, MySQL, SSH, and authentication.",
    "tech_stack": ["Laravel", "JavaScript", "PHP", "MySQL", "SSH", "Authentification"]
  },
  {
    "title": "Pablo Rendering Engine",
    "description": "A personal project where I developed a rendering engine and OpenGL framework from scratch. The engine supports features like physics-based rendering, image-based lighting, and model loading. Implemented in C++, GLSL, CMake, and OpenGL.",
    "tech_stack": ["C++", "GLSL", "Cmake", "OpenGL", "OOP"]
  },
  {
    "title": "Hangout Safari",
    "description": "Designed a web application to help students socialize and overcome social anxiety. It features a 3D interactive safari where you collect animals based on the number of social events attended. Built with Three.js, SvelteKit, microservices, Supabase, and Docker.",
    "tech_stack": ["Three.js", "SvelteKit", "Microservices", "Supabase", "Docker"]
  },
  {
    "title": "Screen Saver for Giant Screen",
    "description": "During a hackathon for the Joint Research Center Zeeland, we created a screen saver for one of the biggest screens in the Netherlands. It displayed a glowing sphere that expanded based on clapping sounds. Also showed animated models of different institutions. Developed using Unity, Blender, and C#.",
    "tech_stack": ["Unity", "Blender", "C#"]
  }
]
